app/controllers/admin_controller.rb

	def index
		id = session[:user_id]
    	@users = User.find(id)
    	if(@users.level!=0)
	    	flash[:notice]="You are not authorized to that page"
	    	flash[:color]="Invalid"
	    	redirect_to '/login'
    	end
		@events=Event.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events"

	def show
		self.isadmin
		eid = params[:eid]
		@eid = params[:eid]
		@eligibleQuestions=Question.where({qtype: ["2","3","4"], eid: eid})
		@UIDs = Array.new
		Answer.where(eid: eid).select(:uid).distinct.each do |x|
			@UIDs.push(x[:uid])
		end
		@Users = Array.new
		@collegeStation = 0
		@houston = 0
		@austin = 0
		@dallasOrFortWorth = 0
		@sanAntonio = 0
		@otherAreaInTexas = 0
		@outOfTexas = 0
		@UIDs.each do |u|
			@Users.push(User.where(id: u).select(:lastname).take[:lastname])
			@Users.push(User.where(id: u).select(:firstname).take[:firstname])
			@Users.push(User.where(id: u).select(:email).take[:email])
			@Users.push(User.where(id: u).select(:phonenumber).take[:phonenumber])
			zipcode=User.where(id: u).select(:zipcode).take[:zipcode]
---
SELECT DISTINCT "answers"."uid" FROM "answers" WHERE "answers"."eid" = ?  [["eid", 1]]
SELECT  "users"."lastname" FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users"."firstname" FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users"."email" FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users"."phonenumber" FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users"."zipcode" FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

	def delete
		self.isadmin
		eid = params[:eid]
		Event.find(eid).destroy
		Answer.where(eid: eid).destroy_all
		Question.where(eid: eid).destroy_all
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 22]]
SELECT "answers".* FROM "answers" WHERE "answers"."eid" = ?  [["eid", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 13]]
SELECT "questions".* FROM "questions" WHERE "questions"."eid" = ?  [["eid", 1]]