app/controllers/answers_controller.rb

SELECT  "questions"."qtitle" FROM "questions" WHERE "questions"."eid" = ? AND "questions"."qid" = ? LIMIT 1  [["eid", 1], ["qid", 1]]
INSERT INTO "answers" ("uid", "qid", "qtitle", "eid", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["uid", 2], ["qid", 1], ["qtitle", "question111111111"], ["eid", 1], ["answer", ",knkl"], ["created_at", "2016-04-09 19:33:35.918336"], ["updated_at", "2016-04-09 19:33:35.918336"]]
---
	def create
	  # show questions
	  if params[:eid] != nil
	  	@eid = params[:eid]
	  else
	  	# handle exceptions
	  end

	  @q = Question.where(:EID => @eid).all

		if params[:commit] != nil && params[:commit] == 'Submit'
			params.each do |key, value|
				if ("#{key}".index('Q') != nil)
                    strqid = "#{key}".delete "Q"
					qid = strqid.to_i
					@answer = Answer.new
					@answer.uid = session[:user_id]
					@answer.qid = qid
					@answer.qtitle = Question.where(eid: params[:q_eid], qid:qid).select(:qtitle).take[:qtitle]
	      	  		@answer.eid = params[:q_eid]
	          		@answer.answer = value[:answer]
	          		if @answer.valid?
	          			if @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."uid" = ? AND "answers"."eid" = ?  [["uid", 2], ["eid", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."eid" = ?  [["eid", 1]]
---
    def showquestion
    	currentuid=session[:user_id]
    	if(Answer.where(uid: currentuid,eid: params[:eid]).all.length != 0)
    		flash[:notice] = "You have already registered for this event!"
    		redirect_to '/allevent'
    	end

    	 # show questions
	  if params[:eid] != nil
	  	@eid = params[:eid]
	  else
	  	# handle exceptions
	  end

	  @q = Question.where(:eid => @eid).all