app/controllers/educators_controller.rb

  def create
    @educator=Educator.new
    @flash_notice = ""
    id = session[:user_id]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]