app/controllers/events_controller.rb

INSERT INTO "events" ("etitle", "elocation", "edescription", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["etitle", "sfdgsd"], ["elocation", ""], ["edescription", ""], ["created_at", "2016-04-12 18:05:23.416692"], ["updated_at", "2016-04-12 18:05:23.416692"]]
---
  def create
    self.isadmin
  	@event = Event.new
  	@flash_notice = ""

  	if params[:commit] != nil && params[:commit] == 'Create'
        @event.evendorflag = params[:Vendor]
        @event.evehicleflag = params[:Vehicle]
        @event.eimpressionflag = params[:Reinactors]
        @event.eeducatorflag = params[:Educators]
  	    @event.etitle = params[:Title]
       	@event.elocation = params[:Location]
       	@event.estart = params[:Start_Date]
      	@event.eend = params[:End_Date]
      	@event.edescription = params[:Description]
      	@event.eavailabilityflag = params[:Availability]
      	if @event.valid?
      		if @event.save

UPDATE "events" SET "eeducatorflag" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["eeducatorflag", 1], ["updated_at", "2016-05-03 08:13:02.961873"], ["id", 1]]
---
              @event.increment!(:eimpressionflag, 1)
            end
            if @event.eeducatorflag
              @event.increment!(:eeducatorflag, 1)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    eid=params[:eid]
  	@event = Event.find(eid)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    self.isadmin
    eid = params[:eid]
    @event = Event.find(eid)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "events" SET "evehicleflag" = ?, "eeducatorflag" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["evehicleflag", 0], ["eeducatorflag", 0], ["updated_at", "2016-05-03 08:13:11.114021"], ["id", 1]]
---
  def update
    self.isadmin
    eid = params[:eid]
    @event = Event.find(eid)
    if params[:commit] != nil && params[:commit] == 'Save'
        @event.evendorflag = params[:Vendor]
		    @event.evehicleflag = params[:Vehicle]
		    @event.eimpressionflag = params[:Reinactors]
		    @event.eeducatorflag = params[:Educators]
		    @event.etitle = params[:Title]
       	@event.elocation = params[:Location]
       	@event.estart = params[:Start_Date]
      	@event.eend = params[:End_Date]
      	@event.edescription = params[:Description]
      	@event.eavailabilityflag = params[:Availability]
      	if @event.valid?
          eid=@event.id
          if @event.evendorflag
            @event.increment!(:evendorflag, 1)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events"
---
  def allevent
    id = session[:user_id]
    @user = User.find(id)

    @curlevel = User.find(id).level
    if(@curlevel != 0)
<<<<<<< HEAD
      id = session[:user_id]
      @user = User.find(id)

      if (@user.uvendorflag != 0)
        @vendorevents = Event.where(evendorflag = 1).all
      end
      if(@user.uvehicleflag != 0)
        @vehicleevents = Event.where(evehicleflag = 1).all
      end
      if(@user.uimpressionflag != 0)
        @impressionevents = Event.where(eimpressionflag = 1).all
      end
      if(@user.ueducatorflag != 0)
        @educatorevents = Event.where(eeducatorflag = 1).all
      end

      @event = @vendorevents
      @event << @vehicleevents
      @event << @impressionevents
      @event << @educatorevents
=======
      @event = Event.all