app/controllers/impressions_controller.rb

  def create
    @impression=Impression.new
    @flash_notice = ""
    id = session[:user_id]
    @user = User.find(id)

    if params[:commit] != nil && params[:commit] == 'Create'
      @impression.iname = params[:Name]
      @impression.iside = params[:Side]
      @impression.iwar = params[:War]
      @impression.commander = params[:Commander]
      @impression.idescription = params[:Description]
      @impression.unitid = params[:Unit]
      @impression.uid = session[:user_id]
      #fill in the value for commander id after completing units
      if @impression.valid?
        if @impression.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "impressions" ("iname", "iside", "iwar", "idescription", "unitid", "uid") VALUES (?, ?, ?, ?, ?, ?)  [["iname", "Lee"], ["iside", "'Murica"], ["iwar", "WW2"], ["idescription", "La Discripticon"], ["unitid", "B52"], ["uid", 1]]

  def show
    self.isuser
    iid = params[:iid]
    @impression = Impression.find(iid)
---
SELECT  "impressions".* FROM "impressions" WHERE "impressions"."id" = ? LIMIT 1  [["id", 1]]