app/controllers/questions_controller.rb

INSERT INTO "questions" ("qid", "eid", "qtitle", "qtype", "qoption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["qid", 1], ["eid", 1], ["qtitle", "question111111111"], ["qtype", "1"], ["qoption", ""], ["created_at", "2016-04-06 23:06:34.846674"], ["updated_at", "2016-04-06 23:06:34.846674"]]
---
	          		@question.qoption = option_str[0...-1]

	          		if @question.valid?
	          			qarray << @question

SELECT "questions".* FROM "questions" WHERE "questions"."eid" = ?  [["eid", 1]]
---
	def show
        eid = params[:eid]
        @questions = Question.where(eid: eid )

SELECT "questions".* FROM "questions" WHERE "questions"."eid" = ?  [["eid", 1]]
---
	def edit
        eid = params[:eid]
        @eid = eid
        @questions = Question.where(eid: eid )

SELECT "questions".* FROM "questions" WHERE "questions"."eid" = ?  [["eid", 1]]
---
	def update

	eid = params[:eid]
    @questions = Question.where(eid: eid )

INSERT INTO "questions" ("qid", "eid", "qtitle", "qtype", "qoption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["qid", 2], ["eid", 1], ["qtitle", "e5yaerhe5"], ["qtype", "1"], ["qoption", ""], ["created_at", "2016-04-12 05:41:38.189361"], ["updated_at", "2016-04-12 05:41:38.189361"]]
---
	          		@question.qoption = option_str[0...-1]

	          		if @question.valid?
	          			qarray << @question