app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 1]]
SELECT DISTINCT "answers"."eid" FROM "answers" WHERE "answers"."uid" = ?  [["uid", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT "impressions".* FROM "impressions" WHERE "impressions"."uid" = ?  [["uid", 4]]
SELECT "vendorbooths".* FROM "vendorbooths" WHERE "vendorbooths"."uid" = ?  [["uid", 4]]
---
  def home
    id = session[:user_id]
    @user = User.find(id)
    if @user.level == 1
      @vehicles=Vehicle.where(user_id: id).all
      @registeredevents =''
      @registeredeid = Answer.where(uid: id).all.uniq.pluck(:eid)
      if (@registeredeid.length !=0)
        @registeredevents = Event.find(@registeredeid)
      end
      @impressions = Impression.where(uid: id).all
      @vendorbooths = Vendorbooth.where(uid: id).all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def profile
    id = session[:user_id]
    @users = User.find(id)

INSERT INTO "users" ("email", "firstname", "lastname", "phonenumber", "gender", "addressline1", "city", "state", "level", "zipcode", "salt", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new
    @flash_notice = ""
    if params[:commit] != nil && params[:commit] == 'Create'
        @user.email = params[:email]
        @user.password = params[:password]
        @user.firstname = params[:firstname]
        @user.lastname = params[:lastname]
        @user.phonenumber = params[:phonenumber]
        if !(/^\d{3}-\d{3}-\d{4}$/.match(params[:phonenumber])  ||/^\d{3}\d{3}\d{4}$/.match(params[:phonenumber]))
          @user.phonenumber = nil
          @flash_notice = "Phone Number Error"
          render 'create'
          return
        end
        @user.gender = params[:gender]
        @user.addressline1 = params[:addressline1]
        @user.city = params[:city]
        @user.state = params[:state]
        @user.level=1
        @user.zipcode=params[:zipcode]
        if ZIP_CODE.find(params[:zipcode]) == nil
          @user.zipcode = nil
          @flash_notice = "Zip Code Error"
          render 'create'
          return
        end
        if @user.valid?
          if @user.save

UPDATE "users" SET "gender" = ?, "salt" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def setting
    id = @current_user.id
    @flash_notice = ""
    if params[:commit] != nil && params[:commit] == 'Save'
      @current_user.email = params[:email]
      @current_user.password = params[:password]
      @current_user.firstname = params[:firstname]
      @current_user.lastname = params[:lastname]
      @current_user.phonenumber = params[:phonenumber]
      @current_user.gender = params[:gender]
      @current_user.addressline1 = params[:addressline1]
      @current_user.city = params[:city]
      @current_user.state = params[:state]
      @current_user.zipcode = params[:zipcode]
      if ZIP_CODE.find(params[:zipcode]) == nil
        @current_user.zipcode = nil
        @flash_notice = "Zip Code Error"
        render 'setting'
        return
      end
      if @current_user.valid?
        if @current_user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_user
    id = session[:user_id]
    @current_user = User.find(id)