app/controllers/vehicles_controller.rb

  def create
    @vehicle=Vehicle.new
    @flash_notice = ""
    id = session[:user_id]
    @user = User.find(id)

    if params[:commit] != nil && params[:commit] == 'Create'
      @vehicle.vname = params[:Name]
      @vehicle.vclass = params[:Class]
      @vehicle.vnation = params[:Nation]
      @vehicle.vwar = params[:War]
      @vehicle.vdescription = params[:Description]
      @vehicle.user_id = session[:user_id]
      if @vehicle.valid?
        if @vehicle.save
          session[:vid] = @vehicle.id
          flash[:notice] = "Vehicle Created Successfully!"
          @vehicle.vid = @vehicle.id
          vid = @vehicle.id
          @user.increment!(:uvehicleflag, 1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "vehicles" ("vname", "vclass", "vnation", "vwar", "vdescription", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["vname", "A's Jeep"], ["vclass", "Wheeled"], ["vnation", "U.S."], ["vwar", "WWI"], ["vdescription", "It's awesome"], ["user_id", 3]]
UPDATE "users" SET "vehicles_count" = COALESCE("vehicles_count", 0) + 1 WHERE "users"."id" = ?  [["id", 3]]

  def show
    self.isuser
    vid = params[:vid]
    @vehicle = Vehicle.find(vid)
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", 13]]

  def edit
    self.isuser
    vid = params[:vid]
    @vehicle = Vehicle.find(vid)
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", 13]]

  def update
    self.isuser
    vid = params[:vid]
    @vehicle = Vehicle.find(vid)
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", 13]]

  def delete

    id = session[:user_id]
    @user = User.find(id)
    vid = params[:vid]

    inventories = Inventorie.where(:uid => id).all
    inventories.each do |inventory|
      newvid = inventory.inventvid
      newvid.gsub("_#{vid}","")
      inventory.inventvid = newvid
      inventory.save
    end

    self.isuser


  	@user.decrement!(:uvehicleflag, 1)
  	Vehicle.find(vid).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "vehicles_count" = COALESCE("vehicles_count", 0) - 1 WHERE "users"."id" = ?  [["id", 3]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 10]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", 10]]