app/controllers/vendorbooths_controller.rb

  def create
    @vendorbooth=Vendorbooth.new
    @flash_notice = ""
    id = session[:user_id]
    @user = User.find(id)

    if params[:commit] != nil && params[:commit] == 'Create'
      @vendorbooth.vbname = params[:Name]
      @vendorbooth.vbdescription = params[:Description]
      @vendorbooth.uid = session[:user_id]
      if @vendorbooth.valid?
        if @vendorbooth.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "vendorbooths" ("vbname", "vbdescription", "uid") VALUES (?, ?, ?)  [["vbname", "Booth of Awesomeness"], ["vbdescription", "La Discripticon of Awesomeness"], ["uid", 1]]

  def show
    self.isuser
    vbid = params[:vbid]
    @vendorbooth = Vendorbooth.find(vbid)
---
SELECT  "vendorbooths".* FROM "vendorbooths" WHERE "vendorbooths"."id" = ? LIMIT 1  [["id", 1]]